In [1]:
import pandas as pd
import numpy as np
import math
import os
import sys

desired_occupation = sys.argv[1]
state_of_residence = sys.argv[2]

In [2]:
occupation_data = pd.read_csv("occupation_data.csv")
university_data = pd.read_csv("university_data.csv")

In [3]:
occupation_data.head()

                                     OccupationTitle MedianWeeklySalary
0            Total full-time wage and salary workers                886
1    Management professional and related occupations               1246
2  Management business and financial operations o...               1355
3                             Management occupations               1429
4                                   Chief executives               2291

In [4]:
university_data.head()

                           UniversityName       City State  OutCost  InCost
0                    Princeton University  Princeton    NJ    51870   51870
1                     ​Harvard University  Cambridge    MA    51925   51925
2                    ​Columbia University   New York    NY    61850    6850
3  ​Massachusetts Institute of Technology  Cambridge    MA    53790   53790
4                        ​Yale University  New Haven    CT    55500   55500

In [5]:
occupation_data.dtypes

OccupationTitle       object
MedianWeeklySalary    object
dtype: object

In [6]:
idx = (occupation_data["MedianWeeklySalary"] == "-")
occupation_data.loc[idx, "MedianWeeklySalary"] = np.nan
occupation_data["MedianWeeklySalary"] = occupation_data["MedianWeeklySalary"].astype(float)
occupation_data.dtypes

OccupationTitle        object
MedianWeeklySalary    float64
dtype: object

In [7]:
university_data.dtypes

UniversityName    object
City              object
State             object
OutCost            int64
InCost             int64
dtype: object

In [8]:
university_data["OutCost"] = university_data["OutCost"].astype(float)
university_data["InCost"] = university_data["InCost"].astype(float)

In [9]:
idx = occupation_data["OccupationTitle"] == desired_occupation
weekly = occupation_data[idx]

weekly.head()

         OccupationTitle  MedianWeeklySalary
68  Computer programmers              1591.0

In [10]:
yearly = weekly["MedianWeeklySalary"].astype(int)*52
monthly_contribution = (yearly.array[0]/12)*.1
print(monthly_contribution)

689.4333333333334

In [11]:
#brute force! sim the months till balance is 0
#I have no idea how finances work
def sim_payoff(tuit, mon_con):
    total_tuit = tuit*4;
    total_months = 0
    while True:
        interest = total_tuit * (.0481/12)
        for i in range(12):
            total_tuit += interest
            total_tuit -= max(mon_con, interest+20)
            total_months += 1
            if total_tuit < 0:
                return total_months/12

university_data["TimeToPayOff"] = university_data["OutCost"].apply(sim_payoff, args=[monthly_contribution])
university_data.head()

,UniversityName,City,State,OutCost,InCost,TimeToPayOff
0,Princeton University,Princeton,NJ,51870.0,51870.0,244.000000
1,​Harvard University,Cambridge,MA,51925.0,51925.0,244.916667
2,​Columbia University,New York,NY,61850.0,6850.0,410.333333
3,​Massachusetts Institute of Technology,Cambridge,MA,53790.0,53790.0,276.000000
4,​Yale University,New Haven,CT,55500.0,55500.0,304.500000

In [12]:
university_data = university_data.sort_values(by="TimeToPayOff")
res = university_data.head(20)

In [13]:
res.to_json("result.json")